Core/src/DataProcessors/ПомощникЗагрузкиБанковскойВыписки/ПомощникЗагрузкиБанковскойВыписки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПомощникЗагрузкиБанковскойВыписки</name>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбменаСИнтернетБанком</name>
    <type>
      <types>EnumRef.ТипыОбменаСИнтернетБанком</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаВыписки</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеПлатежа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипТранзакцийБВ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетБанк</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИНН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодКазначейство</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипОперации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетКорр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>_ШаблонЗаполнения</name>
      <type>
        <types>CatalogRef.ШаблоныЗаполнения</types>
      </type>
    </attributes>
    <attributes>
      <name>_СсылкаНаДокумент</name>
      <type>
        <types>DocumentRef.РасходСоСчета</types>
        <types>DocumentRef.ПеремещениеДС</types>
        <types>DocumentRef.ПоступлениеНаСчет</types>
      </type>
    </attributes>
    <attributes>
      <name>_РасшифрокаTransactionType</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>16</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>_РасшифрокаStatusCode</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>16</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>_ОписаниеОшибки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>_Загружать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>512</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеКт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеДт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетБанкКт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетБанкДт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИННКт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИННДт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент1С</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетКонтрагента1С</name>
      <type>
        <types>CatalogRef.БанковскиеСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>Подотчетник1С</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>16</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Core/src/Enums/ТипыОбменаСИнтернетБанком/ТипыОбменаСИнтернетБанком.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОбменаСИнтернетБанком</name>
  <enumValues>
    <name>TBC</name>
  </enumValues>
  <enumValues>
    <name>BankOfGeorgia</name>
  </enumValues>
  <enumValues>
    <name>Cartu</name>
  </enumValues>
  <enumValues>
    <name>VTB</name>
  </enumValues>
</mdclass:Enum>

Core/src/Documents/ПеремещениеДС/ПеремещениеДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеремещениеДС</name>
  <registerRecords>AccumulationRegister.ПлатежныйКалендарь</registerRecords>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходы</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДенежныхСредств</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДенежныхСредств</name>
    <type>
      <types>EnumRef.ТипыДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДенежныхСредствПолучатель</name>
    <type>
      <types>EnumRef.ТипыДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетПолучатель</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>КассаПолучатель</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПеремещениеДСПлан</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyПроекты</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyJiraCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/Catalogs/ШаблоныЗаполнения/ШаблоныЗаполнения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныЗаполнения</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ИмяСхемыКомпоновкиДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОпераций</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСоответсвияРеквизитов</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаИсточника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийРасходСоСчета</types>
      <types>EnumRef.ВидыОперацийПоступлениеНаСчет</types>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакАванса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбменаСИнтернетБанком</name>
    <type>
      <types>EnumRef.ТипыОбменаСИнтернетБанком</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнитьДоговор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Корреспонденция</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНалога</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>Действующий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекСчетПолучатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КорреспонденцияРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
</mdclass:Catalog>

Core/src/DataProcessors/ПомощникЗагрузкиБанковскойВыписки/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ОткрытьШаблоныЗаполнения(Команда)
	
	ОткрытьФорму("Справочник.ШаблоныЗаполнения.ФормаВыбора",, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	УстановитьСнятьФлажки(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	УстановитьСнятьФлажки(Истина);
КонецПроцедуры

&НаСервере
Процедура УстановитьСнятьФлажки(знч_Загружать)
	AccountMovement = Объект.ТаблицаВыписки;
	Для Каждого Стр Из AccountMovement Цикл
		Если знч_Загружать И ЗначениеЗаполнено(Стр._ШаблонЗаполнения) Тогда 
			Стр._Загружать = знч_Загружать;
		Иначе 
			Стр._Загружать = знч_Загружать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбораФайла.Фильтр                      = НСтр("ka='ფაილი Excel 2007 (*.xlsx)|*.xlsx';ru='Книга Excel 2007 (*.xlsx)|*.xlsx'");
	ДиалогВыбораФайла.Заголовок                   = Заголовок;
	ДиалогВыбораФайла.ПредварительныйПросмотр     = Ложь;
	ДиалогВыбораФайла.Расширение                  = "xlsx";
	ДиалогВыбораФайла.ИндексФильтра               = 0;
	//ДиалогВыбораФайла.ПолноеИмяФайла              = ИмяФайла;
	//ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Ложь;
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		Объект.ПутьКФайлу = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура Загрузить(Команда)
	
	ЗагрузитьНаКлиенте(Объект.ПутьКФайлу);
	
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьНаКлиенте(АдресФайла)
	
	
	Если не ПроверитьЗаполнение() Тогда 
		Возврат;
	КонецЕсли;

	Попытка
		Excel = Новый COMОбъект("Excel.Application");
	Исключение
		Сообщить("Похоже, Excel на компьютере не установлен. Необходимо выполнить установку/переустановку Excel.");
		Возврат;
	КонецПопытки;     
	
	Excel.Workbooks.Open(АдресФайла);
	Книга = Excel.ActiveWorkbook; 
	
	//ЗагрузитьНаСервере(Excel, Книга);

	Если BOG Тогда
		Лист = Книга.Worksheets(1);
	ИначеЕсли TBC Тогда 
		Лист = Книга.Worksheets(2);
	ИначеЕсли CARTU Тогда 
		Лист = Книга.Worksheets(2);
	ИначеЕсли VTB Тогда 
		Лист = Книга.Worksheets(1);
	КонецЕсли;
	
	ArrExcel = Лист.UsedRange.Value.Выгрузить();
	
	ЗагрузитьНаСервере(ArrExcel);
	
	Excel.quit();
	Excel.Application.Quit();

	
КонецПроцедуры 

&НаСервере
Процедура ЗагрузитьНаСервере(ArrExcel)
	
	Если BOG Тогда
		BOG_ЗагрузитьНаСервере(ArrExcel,Перечисления.ТипыОбменаСИнтернетБанком.BankOfGeorgia);
	КонецЕсли;
	
	Если TBC Тогда
		TBC_ЗагрузитьНаСервере(ArrExcel,Перечисления.ТипыОбменаСИнтернетБанком.TBC);
	КонецЕсли;
	
	Если CARTU Тогда
		CARTU_ЗагрузитьНаСервере(ArrExcel,Перечисления.ТипыОбменаСИнтернетБанком.Cartu);
	КонецЕсли;
	
	Если VTB Тогда
		VTB_ЗагрузитьНаСервере(ArrExcel,Перечисления.ТипыОбменаСИнтернетБанком.VTB);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура BOG_ЗагрузитьНаСервере(ArrExcel,ТипОбмена)
	СтруктураКолонок = ПолучитьСтруктуруСоответствииКолонок(ТипОбмена);
	
	Объект.ТаблицаВыписки.Очистить();
	врТаблицаВыписки = Объект.ТаблицаВыписки.Выгрузить();
	врТаблицаВыпискиШ =  врТаблицаВыписки.Скопировать();
	Для Каждого стр Из ArrExcel[0] Цикл 
		врТаблицаВыписки.Добавить();
	КонецЦикла;
	
	Для каждого стрСтруктури Из СтруктураКолонок Цикл
		стЗначение = стрСтруктури.Значение;
		стКлюч	   = стрСтруктури.Ключ;
		
		Если стКлюч = "НаименованиеКт" Или стКлюч = "НаименованиеДт" Тогда
			//стКлюч = "Наименование";
		ИначеЕсли стКлюч = "ИННКт" Или стКлюч = "ИННДт" Тогда
			//стКлюч = "ИНН";
		ИначеЕсли стКлюч = "СчетБанкКт" Или стКлюч = "СчетБанкДт" Тогда
			//стКлюч = "СчетБанк";
		КонецЕсли;
		Попытка
			врТаблицаВыписки.ЗагрузитьКолонку(ArrExcel[стЗначение-1],стКлюч);
		Исключение
			Сообщить(ОписаниеОшибки() +  " колонка " + " стЗначение ");
		КонецПопытки;
	КонецЦикла;
	
	МассивУдаления = Новый Массив;
	Для каждого СтрокаВыписки Из врТаблицаВыписки Цикл
		Если СтрокаВыписки.Дата = "" 
			Или Не ЗначениеЗаполнено(СтрокаВыписки.Дата) 
			Или СтрокаВыписки.Дата = "ამონაწერი" 
			Или СтрокаВыписки.Дата = "თარიღი"	Тогда 
			МассивУдаления.Добавить(СтрокаВыписки);
			Продолжить;
		ИначеЕсли ЗначениеЗаполнено(СтрокаВыписки.СуммаДт) Тогда 
			СтрокаВыписки.Наименование = СтрокаВыписки.НаименованиеДт;
			СтрокаВыписки.ИНН = СтрокаВыписки.ИННДт;
			СтрокаВыписки.СчетБанк = СтрокаВыписки.СчетБанкДт;
		ИначеЕсли ЗначениеЗаполнено(СтрокаВыписки.СуммаКт) Тогда 
			СтрокаВыписки.Наименование = СтрокаВыписки.НаименованиеКт;
			СтрокаВыписки.ИНН = СтрокаВыписки.ИННКт;
			СтрокаВыписки.СчетБанк = СтрокаВыписки.СчетБанкКт;
		КонецЕсли;
		врТаблицаВыпискиШ.Очистить();
		СтрокаВыпискиШ = врТаблицаВыпискиШ.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаВыпискиШ,СтрокаВыписки);
		СтрокаВыписки._ШаблонЗаполнения = СоответствоватьШаблонЗаполнения(врТаблицаВыпискиШ);
		
		пИНН = СтрЗаменить(СтрокаВыписки.ИНН, " ", "");//Паганини
		СтрокаВыписки.ID = 
		СтрокаВыписки.Ключ 
		+ "_" + Лев(СтрокаВыписки.Дата, 10) 
		+ "_" + пИНН//СтрокаВыписки.ИНН 
		+ "_" + СтрокаВыписки.НомерДокумента 
		+ ?(ЗначениеЗаполнено(СтрокаВыписки.СуммаДт), "_" + Строка(СтрокаВыписки.СуммаДт), "")
		+ ?(ЗначениеЗаполнено(СтрокаВыписки.СуммаКт), "_-" + Строка(СтрокаВыписки.СуммаКт), "") 
		+ "_" + СтрокаВыписки.НазначениеПлатежа;
		
		СтрокаВыписки._СсылкаНаДокумент  = НайтиДокументПоИД(СтрокаВыписки.ID);
		
		//Паганини_
		СтрокаВыписки.Контрагент1С      = НайтиКонтрагента(пИНН,СтрокаВыписки.Наименование);//СтрокаВыписки.ИНН
		СтрокаВыписки.Подотчетник1С     = НайтиПодотчетника(пИНН);                          //СтрокаВыписки.ИНН
		СтрокаВыписки.СчетКонтрагента1С = НайтиСчет(СтрокаВыписки.Контрагент1С,СтрокаВыписки.СчетБанк);
		//_Паганини
		
	КонецЦикла;
	
	Для каждого стрМУд Из МассивУдаления Цикл
		врТаблицаВыписки.Удалить(стрМУд);
	КонецЦикла;
	Объект.ТаблицаВыписки.Загрузить(врТаблицаВыписки);
	

КонецПроцедуры 

&НаСервере
Процедура TBC_ЗагрузитьНаСервере(ArrExcel,ТипОбмена)

    СтруктураКолонок = ПолучитьСтруктуруСоответствииКолонок(ТипОбмена);

	Объект.ТаблицаВыписки.Очистить();
	врТаблицаВыписки = Объект.ТаблицаВыписки.Выгрузить();
	врТаблицаВыпискиШ =  врТаблицаВыписки.Скопировать();
	Для Каждого стр Из ArrExcel[0] Цикл 
		врТаблицаВыписки.Добавить();
	КонецЦикла;
	
	Для каждого стрСтруктури Из СтруктураКолонок Цикл
		стЗначение = стрСтруктури.Значение;
		стКлюч	   = стрСтруктури.Ключ;
		Попытка
			врТаблицаВыписки.ЗагрузитьКолонку(ArrExcel[стЗначение-1],стКлюч);
		Исключение
			Сообщить(ОписаниеОшибки() +  " колонка " + " стЗначение ");
		КонецПопытки;
	КонецЦикла;
	
	МассивУдаления = Новый Массив;
	Для каждого СтрокаВыписки Из врТаблицаВыписки Цикл
		Если  НЕ ЗначениеЗаполнено(СтрокаВыписки.Дата)
			Или СтрокаВыписки.Дата = "" 
			Или СтрокаВыписки.Дата = "ამონაწერი" 
			Или СтрокаВыписки.Дата = "თარიღი"	 
			Или СтрокаВыписки.Дата = "Date"	Тогда 
			МассивУдаления.Добавить(СтрокаВыписки);
			Продолжить;
		КонецЕсли;
		
		врТаблицаВыпискиШ.Очистить();
		СтрокаВыпискиШ = врТаблицаВыпискиШ.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаВыпискиШ,СтрокаВыписки);
		СтрокаВыписки._ШаблонЗаполнения = СоответствоватьШаблонЗаполнения(врТаблицаВыпискиШ);
		
		пИНН = СтрЗаменить(СтрокаВыписки.ИНН, " ", "");//Паганини
		СтрокаВыписки.ID = 
		СтрокаВыписки.Ключ 
		+ "_" + Строка(СтрокаВыписки.Дата) 
		+ "_" + пИНН//СтрокаВыписки.ИНН 
		+ "_" + СтрокаВыписки.НомерДокумента 
		+ ?(ЗначениеЗаполнено(СтрокаВыписки.СуммаДт), "_" + Строка(СтрокаВыписки.СуммаДт), "")
		+ ?(ЗначениеЗаполнено(СтрокаВыписки.СуммаКт), "_-" + Строка(СтрокаВыписки.СуммаКт), "") 
		+ "_" + СтрокаВыписки.НазначениеПлатежа;
		
		СтрокаВыписки._СсылкаНаДокумент  = НайтиДокументПоИД(СтрокаВыписки.ID);
		
		СтрокаВыписки.Контрагент1С      = НайтиКонтрагента(пИНН,СтрокаВыписки.Наименование);//СтрокаВыписки.ИНН
		СтрокаВыписки.Подотчетник1С     = НайтиПодотчетника(пИНН);                          //СтрокаВыписки.ИНН
		СтрокаВыписки.СчетКонтрагента1С = НайтиСчет(СтрокаВыписки.Контрагент1С,СтрокаВыписки.СчетБанк);
		
	КонецЦикла;
	
	Для каждого стрМУд Из МассивУдаления Цикл
		врТаблицаВыписки.Удалить(стрМУд);
	КонецЦикла;
	Объект.ТаблицаВыписки.Загрузить(врТаблицаВыписки);


КонецПроцедуры // ()

&НаСервере
Процедура CARTU_ЗагрузитьНаСервере(ArrExcel,ТипОбмена)

    СтруктураКолонок = ПолучитьСтруктуруСоответствииКолонок(ТипОбмена);

	Объект.ТаблицаВыписки.Очистить();
	врТаблицаВыписки = Объект.ТаблицаВыписки.Выгрузить();
	врТаблицаВыпискиШ =  врТаблицаВыписки.Скопировать();
	Для Каждого стр Из ArrExcel[0] Цикл 
		врТаблицаВыписки.Добавить();
	КонецЦикла;
	
	Для каждого стрСтруктури Из СтруктураКолонок Цикл
		стЗначение = стрСтруктури.Значение;
		стКлюч	   = стрСтруктури.Ключ;
		Попытка
			врТаблицаВыписки.ЗагрузитьКолонку(ArrExcel[стЗначение-1],стКлюч);
		Исключение
			Сообщить(ОписаниеОшибки() +  " колонка " + " стЗначение ");
		КонецПопытки;
	КонецЦикла;
	
	МассивУдаления = Новый Массив;
	Для каждого СтрокаВыписки Из врТаблицаВыписки Цикл
		Если  НЕ ЗначениеЗаполнено(СтрокаВыписки.Дата)
			Или СтрокаВыписки.Дата = "" 
			Или СтрокаВыписки.Дата = "ამონაწერი" 
			Или СтрокаВыписки.Дата = "თარიღი"	 
			Или СтрокаВыписки.Дата = "Date"	Тогда 
			МассивУдаления.Добавить(СтрокаВыписки);
			Продолжить;
		КонецЕсли;
		
		врТаблицаВыпискиШ.Очистить();
		СтрокаВыпискиШ = врТаблицаВыпискиШ.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаВыпискиШ,СтрокаВыписки);
		СтрокаВыписки._ШаблонЗаполнения = СоответствоватьШаблонЗаполнения(врТаблицаВыпискиШ);
		
		пИНН = СтрЗаменить(СтрокаВыписки.ИНН, " ", "");//Паганини
		СтрокаВыписки.ID = 
		СтрокаВыписки.Ключ 
		+ "_" + Строка(СтрокаВыписки.Дата) 
		+ "_" + пИНН//СтрокаВыписки.ИНН 
		+ "_" + СтрокаВыписки.НомерДокумента 
		+ ?(ЗначениеЗаполнено(СтрокаВыписки.СуммаДт), "_" + Строка(СтрокаВыписки.СуммаДт), "")
		+ ?(ЗначениеЗаполнено(СтрокаВыписки.СуммаКт), "_-" + Строка(СтрокаВыписки.СуммаКт), "") 
		+ "_" + СтрокаВыписки.НазначениеПлатежа;
		
		СтрокаВыписки._СсылкаНаДокумент  = НайтиДокументПоИД(СтрокаВыписки.ID);
		
		СтрокаВыписки.Контрагент1С      = НайтиКонтрагента(пИНН,СтрокаВыписки.Наименование);//СтрокаВыписки.ИНН
		СтрокаВыписки.Подотчетник1С     = НайтиПодотчетника(пИНН);							//СтрокаВыписки.ИНН
		СтрокаВыписки.СчетКонтрагента1С = НайтиСчет(СтрокаВыписки.Контрагент1С,СтрокаВыписки.СчетБанк);
		
	КонецЦикла;
	
	Для каждого стрМУд Из МассивУдаления Цикл
		врТаблицаВыписки.Удалить(стрМУд);
	КонецЦикла;
	Объект.ТаблицаВыписки.Загрузить(врТаблицаВыписки);


КонецПроцедуры // ()

&НаСервере
Процедура VTB_ЗагрузитьНаСервере(ArrExcel,ТипОбмена)

    СтруктураКолонок = ПолучитьСтруктуруСоответствииКолонок(ТипОбмена);

	Объект.ТаблицаВыписки.Очистить();
	врТаблицаВыписки = Объект.ТаблицаВыписки.Выгрузить();
	врТаблицаВыпискиШ =  врТаблицаВыписки.Скопировать();
	Для Каждого стр Из ArrExcel[0] Цикл 
		врТаблицаВыписки.Добавить();
	КонецЦикла;
	
	Для каждого стрСтруктури Из СтруктураКолонок Цикл
		стЗначение = стрСтруктури.Значение;
		стКлюч	   = стрСтруктури.Ключ;
		Попытка
			Если VTB И стКлюч = "Дата" Тогда 
				врТаблицаВыписки.ЗагрузитьКолонку(ArrExcel[стЗначение-1],"ДатаСтрока");
			Иначе 
				врТаблицаВыписки.ЗагрузитьКолонку(ArrExcel[стЗначение-1],стКлюч);
			КонецЕсли;
		Исключение
			Сообщить(ОписаниеОшибки() +  " колонка " + " стЗначение ");
		КонецПопытки;
	КонецЦикла;
	
	МассивУдаления = Новый Массив;
	Для каждого СтрокаВыписки Из врТаблицаВыписки Цикл
		Если  НЕ VTB Тогда 
			Если НЕ ЗначениеЗаполнено(СтрокаВыписки.Дата) 
				Или  СтрокаВыписки.Дата = "" 
				Или СтрокаВыписки.Дата = "ამონაწერი" 
				Или СтрокаВыписки.Дата = "თარიღი"	 
				Или СтрокаВыписки.Дата = "დანიშნულება"	 
				Или СтрокаВыписки.Дата = "Date"	Тогда 
				МассивУдаления.Добавить(СтрокаВыписки);
				Продолжить;
			КонецЕсли;
		ИначеЕсли VTB Тогда
			Если НЕ ЗначениеЗаполнено(СтрокаВыписки.ДатаСтрока) 
				Или  СтрокаВыписки.ДатаСтрока = "" 
				Или СтрокаВыписки.ДатаСтрока = "ამონაწერი" 
				Или СтрокаВыписки.ДатаСтрока = "თარიღი"	 
				Или СтрокаВыписки.ДатаСтрока = "დანიშნულება"	 
				Или СтрокаВыписки.ДатаСтрока = "Date"	Тогда 
				МассивУдаления.Добавить(СтрокаВыписки);
			Иначе 
				СтрокаВыписки.Дата = ПреобразоватьВДату(СтрокаВыписки.ДатаСтрока);
				Если НЕ ЗначениеЗаполнено(СтрокаВыписки.Дата) Тогда 
					МассивУдаления.Добавить(СтрокаВыписки);
					Продолжить;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		врТаблицаВыпискиШ.Очистить();
		СтрокаВыпискиШ = врТаблицаВыпискиШ.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаВыпискиШ,СтрокаВыписки);
		СтрокаВыписки._ШаблонЗаполнения = СоответствоватьШаблонЗаполнения(врТаблицаВыпискиШ);
		
		пИНН = СтрЗаменить(СтрокаВыписки.ИНН, " ", "");//Паганини
		СтрокаВыписки.ID = 
		СтрокаВыписки.Ключ 
		+ "_" + Строка(СтрокаВыписки.Дата) 
		+ "_" + пИНН//СтрокаВыписки.ИНН 
		+ "_" + СтрокаВыписки.НомерДокумента 
		+ ?(ЗначениеЗаполнено(СтрокаВыписки.СуммаДт), "_" + Строка(СтрокаВыписки.СуммаДт), "")
		+ ?(ЗначениеЗаполнено(СтрокаВыписки.СуммаКт), "_-" + Строка(СтрокаВыписки.СуммаКт), "") 
		+ "_" + СтрокаВыписки.НазначениеПлатежа;
		
		СтрокаВыписки._СсылкаНаДокумент  = НайтиДокументПоИД(СтрокаВыписки.ID);
		
		СтрокаВыписки.Контрагент1С      = НайтиКонтрагента(пИНН,СтрокаВыписки.Наименование);//СтрокаВыписки.ИНН
		СтрокаВыписки.Подотчетник1С     = НайтиПодотчетника(пИНН);							//СтрокаВыписки.ИНН
		СтрокаВыписки.СчетКонтрагента1С = НайтиСчет(СтрокаВыписки.Контрагент1С,СтрокаВыписки.СчетБанк);
		
	КонецЦикла;
	
	Для каждого стрМУд Из МассивУдаления Цикл
		врТаблицаВыписки.Удалить(стрМУд);
	КонецЦикла;
	Объект.ТаблицаВыписки.Загрузить(врТаблицаВыписки);


КонецПроцедуры // ()

&НаСервере
Функция ПреобразоватьВДату(ДатаСтрока)
	
	ТекДата = "";	
	Попытка
		врДенъ  = Лев(ДатаСтрока,2);
		врМесяц = Сред(ДатаСтрока,4,2);
		врГод   = Прав(ДатаСтрока,4);
		
		ТекДата = Дата(врГод+врМесяц+врДенъ);
	Исключение
	КонецПопытки;
	
	Возврат ТекДата;
	
КонецФункции

&НаСервере
Функция НайтиКонтрагента(ИНН,Наименование)
	
	наидКонтрагент = Неопределено;
	Если Не (ЗначениеЗаполнено(ИНН) ИЛИ ЗначениеЗаполнено(Наименование)) Тогда
		Возврат наидКонтрагент;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИНН) Тогда
		
		наидКонтрагент = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН",ИНН);
		Если Не ЗначениеЗаполнено(наидКонтрагент) Тогда 
			наидКонтрагент = Справочники.Контрагенты.НайтиПоНаименованию(Наименование);
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(Наименование) Тогда 
		наидКонтрагент = Справочники.Контрагенты.НайтиПоНаименованию(Наименование);
	КонецЕсли;
	
	Возврат наидКонтрагент;
	
КонецФункции //

&НаСервере
Функция НайтиПодотчетника(ЛичныйНомер)
	
	ЗнчВозврата = Справочники.Сотрудники.ПустаяСсылка();
	Если Не ЗначениеЗаполнено(ЛичныйНомер) Тогда 
		Возврат ЗнчВозврата;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.Ссылка
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	НЕ Сотрудники.ПометкаУдаления
	|	И Сотрудники.Физлицо.ИНН = &ПерсональныйНомер
	|	И НЕ Сотрудники.Физлицо.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ПерсональныйНомер", ЛичныйНомер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		ЗнчВозврата = ВыборкаДетальныеЗаписи.Ссылка;
		
	КонецЕсли;  
	Возврат ЗнчВозврата;
	
КонецФункции //


&НаСервере
Функция НайтиСчет(Контрагент1С,СчетБанк)
	
	ЗнчВозврата = Справочники.БанковскиеСчета.ПустаяСсылка();
	
	наидСчет = Справочники.БанковскиеСчета.НайтиПоРеквизиту("НомерСчета", СчетБанк);
	Если наидСчет.Владелец = Контрагент1С Тогда
		ЗнчВозврата =  наидСчет;
	КонецЕсли;
	
	Возврат ЗнчВозврата;
	
КонецФункции //


&НаСервере
Функция СоответствоватьШаблонЗаполнения(СтрокаВыписки) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ШаблоныЗаполнения.Ссылка КАК ШаблонЗаполнения
	               |ИЗ
	               |	Справочник.ШаблоныЗаполнения КАК ШаблоныЗаполнения
	               |ГДЕ
	               |	НЕ ШаблоныЗаполнения.ПометкаУдаления
	               |	И ШаблоныЗаполнения.ТипОбменаСИнтернетБанком = &ТипОбменаСИнтернетБанком
	               |	И ШаблоныЗаполнения.Действующий";
	
	Запрос.УстановитьПараметр("ТипОбменаСИнтернетБанком", Объект.ТипОбменаСИнтернетБанком);			   
	Результат = Запрос.Выполнить();
	стрШаблонЗаполнения = Результат.Выбрать();
	
	
	
	//Для Каждого стрШаблонЗаполнения Из ШаблоныЗаполнения Цикл 
	Пока стрШаблонЗаполнения.Следующий() Цикл 
		
		//стрШаблонЗаполнения = Выборка.Ссылка; 
		НастройкиШаблонЗаполнения =  стрШаблонЗаполнения.ШаблонЗаполнения.ХранилищеНастроекКомпоновкиДанных.получить();
		ВнешниеНаборыДанных=Новый Структура;
		ВнешниеНаборыДанных.Вставить("ВнешниеДанные",СтрокаВыписки);

		Если BOG Тогда
			СхемаКомпоновкиДанных = Справочники.ШаблоныЗаполнения.ПолучитьМакет("МакетЗагрузкиВыписокСФайла_BOG");
		ИначеЕсли TBC Тогда
			СхемаКомпоновкиДанных = Справочники.ШаблоныЗаполнения.ПолучитьМакет("МакетЗагрузкиВыписокСФайла_TBC");
		ИначеЕсли CARTU Тогда
			СхемаКомпоновкиДанных = Справочники.ШаблоныЗаполнения.ПолучитьМакет("МакетЗагрузкиВыписокСФайла_CARTU");
		ИначеЕсли VTB Тогда
			СхемаКомпоновкиДанных = Справочники.ШаблоныЗаполнения.ПолучитьМакет("МакетЗагрузкиВыписокСФайла_VTB");
		КонецЕсли;
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиШаблонЗаполнения,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		//МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиШаблонЗаполнения);
		
		// Построение таблицы значений.
		Процессор = Новый ПроцессорКомпоновкиДанных;
		Процессор.Инициализировать(МакетКомпоновкиДанных,ВнешниеНаборыДанных);
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений();
		ИсходныеДанные  = Новый ТаблицаЗначений;
		ПроцессорВывода.УстановитьОбъект(ИсходныеДанные);
		ПроцессорВывода.Вывести(Процессор);
		Если ИсходныеДанные.Количество() Тогда 
			Возврат  стрШаблонЗаполнения.ШаблонЗаполнения;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат  Справочники.ШаблоныЗаполнения.ПустаяСсылка();

КонецФункции


&НаСервере
Функция ПолучитьСтруктуруСоответствииКолонок(ТипОбмена)
	
	СтруктураКолонок = Новый Структура;
	
	//Макет = Обработки.ОбменСБанкомСФайлом.ПолучитьМакет("СоответствиеКолонокЗагрузкиВыписокСФайла");
	Макет =  Справочники.ШаблоныЗаполнения.ПолучитьМакет("СоответствиеКолонокЗагрузкиВыписокСФайла");
	Если ТипОбмена = Перечисления.ТипыОбменаСИнтернетБанком.BankOfGeorgia Тогда 
		
		Если Объект.БанковскийСчет.ВалютаДенежныхСредств = Константы.ВалютаУчета.Получить() Тогда 
			ОбластьКолонок = Макет.ПолучитьОбласть("BOG_Excel");
		Иначе
			ОбластьКолонок = Макет.ПолучитьОбласть("BOG_Вал_Excel");
		КонецЕсли;
		
		
	ИначеЕсли ТипОбмена = Перечисления.ТипыОбменаСИнтернетБанком.TBC Тогда 
		
		ОбластьКолонок = Макет.ПолучитьОбласть("TBC_Excel");
			
	ИначеЕсли ТипОбмена = Перечисления.ТипыОбменаСИнтернетБанком.Cartu Тогда 
		
		ОбластьКолонок = Макет.ПолучитьОбласть("CARTU_Excel");
		
	ИначеЕсли ТипОбмена = Перечисления.ТипыОбменаСИнтернетБанком.VTB Тогда 
		
		ОбластьКолонок = Макет.ПолучитьОбласть("VTB_Excel");
		
	КонецЕсли;                                   
	
	Если ОбластьКолонок <> Неопределено Тогда 
		Колонка1с = "";
		Для Сч = 1 По ОбластьКолонок.ВысотаТаблицы   Цикл 
			Колонка1с = ОбластьКолонок.Область(Сч, 5, Сч,5).Текст;
			Если ЗначениеЗаполнено(Колонка1с) Тогда 
				СтруктураКолонок.Вставить(Колонка1с,Число(ОбластьКолонок.Область(Сч, 1, Сч, 1).Текст));
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат СтруктураКолонок;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗапольнитьОрганизациюИАвтор();
	
	BOG = Объект.ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.BankOfGeorgia;
	TBC = Объект.ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.TBC;
	CARTU = Объект.ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.Cartu;
	VTB = Объект.ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.VTB;
	
КонецПроцедуры

&НаСервере
Процедура ЗапольнитьОрганизациюИАвтор()

	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	Объект.Автор = ТекПользователь ;
	ЗначениеНастройки = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ТекПользователь, "ОсновнаяОрганизация");
	Если ЗначениеЗаполнено(ЗначениеНастройки) Тогда
		Если Объект.Организация <> ЗначениеНастройки Тогда
			Объект.Организация = ЗначениеНастройки;
		КонецЕсли;
	Иначе
		Объект.Организация = УправлениеНебольшойФирмойСервер.ПолучитьПредопределеннуюОрганизацию();
	КонецЕсли;

КонецПроцедуры // ()


&НаКлиенте
Процедура ТипОбменаСИнтернетБанкомПриИзменении(Элемент)
	ТипОбменаСИнтернетБанкомПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТипОбменаСИнтернетБанкомПриИзмененииНаСервере()
	
	BOG = Объект.ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.BankOfGeorgia;
	TBC = Объект.ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.TBC;
	CARTU = Объект.ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.Cartu;
	VTB = Объект.ТипОбменаСИнтернетБанком = Перечисления.ТипыОбменаСИнтернетБанком.VTB;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыНаСервере()
	
	воОбъект =  РеквизитФормыВЗначение("Объект");
	воОбъект.СоздатьДокументы();
	ЗначениеВРеквизитФормы(воОбъект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	СоздатьДокументыНаСервере();
КонецПроцедуры

Функция НайтиДокументПоИД(ID)
	
	НаиденныйДок = Документы.РасходСоСчета.НайтиПоРеквизиту("ID",ID);
	
	Если НЕ ЗначениеЗаполнено(НаиденныйДок) Тогда 
		
		НаиденныйДок = Документы.ПоступлениеНаСчет.НайтиПоРеквизиту("ID",ID);
		
	ИначеЕсли НЕ ЗначениеЗаполнено(НаиденныйДок) Тогда 
		
		НаиденныйДок = Документы.ПеремещениеДС.НайтиПоРеквизиту("ID",ID);
		
	КонецЕсли;
	
	Возврат НаиденныйДок;
	
КонецФункции
